jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
#include "stm32f4xx.h"
#include "uart5.h"
#include "network_handle.h"
#include "printer.h"
#include "delay.h"
#include "rtc.h"
#include "stdio.h"

static long Batch = 0x00 ;//交易流水号  	

unsigned char  TID[7] = {0xa2,0x00,0x04,0x10,0x00,0x00,0x04}; /*终端TID码 10000004*/
unsigned char  BRWN[7+3] = {0xa6,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0x00,0x00};	 /*交易流水线*/
unsigned char  BNO[6] = {0xa7,0x00,0x03,0x00,0x00,0x00};               /*批次号*/
unsigned char  DeviceArea[3+3]={0xac,0x00,0x03,0x17,0x03,0x01};         /*终端所在区域编号*/
unsigned char  DeviceAreaNO[4+3]={0xad,0x00,0x04,0x17,0x03,0x01,0x06};   /*终端所在地域编号*/  
unsigned char  DeviceStatus[2+3]={0xae,0x00,0x02,'0','0'};	   /*终端状态*/
unsigned char  DealData[7]={0xa9,0x00,0x04,0x00,0x00,0x00,0x00};       /*交易日期*/
unsigned char  DealTime[6]={0xaa,0x00,0x03,0x00,0x00,0x00};       /*交易时间*/   
unsigned char  MAC[8+3]={0xc9,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};   /*MAC*/
unsigned char  DealBalance[6+3]={0xb0,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};    /*交易金额*/
unsigned char  MealID[4+3] = {0xb1,0x00,0x04,0x10,0x00,0x00,0x20} ;                /*餐品ID  10000020*/
unsigned char  MealNO[1+3] = {0xb2,0x00,0x01,0x00};		   /*餐品购买数量*/
unsigned char  MealName[20+3] ={0xb3,0x00,0x14,'a','b','c','d','e','a','b','c','d','e','a','b','c','d','e','a','b','c','d','a'};  /*餐品名字*/
unsigned char  MealPrice[6+3]={0xbd,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};	  /*餐品价格*/
unsigned char  PayType[1+3]={0xbf,0x00,0x01,0x00};        /*支付方式*/
unsigned char  Change[6+3]={0xd7,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00} ;        /*找零金额*/
unsigned char  RemainMealNum[2+3]={0xd8,0x00,0x02,0x00,0x00};  /*剩余餐品数量*/
unsigned char  MName[20+3]={0xa4,0x00,0x14,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};             /*商户号MID*/
unsigned char  APPVersion[8+3]={ 0xc2,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};       /*应用程序版本*/
unsigned char  ParaFileVersion[8+3]={0xc3,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};  /*参数文件版本*/ 
unsigned char  BDataFileVersion[8+3]={0xc4,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};	/*业务数据文件版本*/ 
unsigned char  ChechStatus[2+3]={0xab,0x00,0x02,0x00,0x00};                                     /*自检状态*/
unsigned char  MID[3+3]={ 0xa3,0x00,0x03,0x10,0x00,0x01};                                       /*商户号MID*/
unsigned char  TTCount[3+2]     ={0xb7,0x00,0x02,0x00,0x00};	                                            /*交易总笔数 */
unsigned char  TNCT[6+3]        ={0xb8,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};                            /*交易总金额*/
unsigned char  TNtype[3+2]      ={0xd9,0x00,0x02,0x00,0x00};											    /*交易总产品数 d9*/
unsigned char  TotalChange[3+6] ={0xd7,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};							/*总找零金额 d7*/
	
unsigned char  UpdataFlag[4];
unsigned char  ACK[3];  //这个是什么?
unsigned char  WordKeyCipher[11];
Meal_struction Meal[9]={
	                        /*餐品ID*/				/*餐品名字*/  	       /*餐品数量*/	     /*餐品价格*/			  /*餐品类型*/
							      0x10,0x00,0x00,0x20,  {"红萝卜炒蛋          "}, 0x00,0xc8,      0x00,0x00,0x15,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x21,  {"菜脯煎蛋            "}, 0x00,0x00,      0x00,0x00,0x15,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x22,  {"土豆牛腩            "}, 0x00,0x00,      0x00,0x00,0x15,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x23,  {"香菇滑鸡            "}, 0x00,0x00,      0x00,0x00,0x20,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x24,  {"红烧鱼块            "}, 0x00,0x00,      0x00,0x00,0x20,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x25,  {"咖喱土鸡            "}, 0x00,0x00,      0x00,0x00,0x20,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x26,  {"脆皮烧鸭            "}, 0x00,0x00,      0x00,0x00,0x25,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x27,  {"梅菜扣肉            "}, 0x00,0x00,      0x00,0x00,0x25,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x28,  {"秘制叉烧            "}, 0x00,0x00,      0x00,0x00,0x25,0x00,	   {"C005"},	
	                      };

 /*******************************************************************************
* Function Name  : GetBRWN
* Description    : 功能: 得到流水号
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
void GetBRWN(void)
{
   /*时间作为流水号*/
  RTC_TimeShow();
	BRWN[3] =    20 /10 *16 + 20%10 ;	        /*年*/
	BRWN[4] =    TimeDate.Year /10 *16 +  TimeDate.Year%10 ;
	BRWN[5] =    TimeDate.Month /10 *16 + TimeDate.Month%10 ;
	BRWN[6] =    TimeDate.Date /10 *16 +  TimeDate.Date%10 ;
	BRWN[7] =    TimeDate.Hours /10 *16 + TimeDate.Hours%10 ;
	BRWN[8] =    TimeDate.Minutes /10 *16 + TimeDate.Minutes%10 ;
	BRWN[9] =    TimeDate.Senconds /10 *16 + TimeDate.Senconds%10 ;
  
}		



/*******************************************************************************
* Function Name  : GetCrc16
* Description    : 进行CRC校验
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
static unsigned int GetCrc16(unsigned char *bufData,unsigned int sizeData)
 {
  	 unsigned int Crc ,i = 0;
	 unsigned char j = 0;
	 if(sizeData == 0)
	 return 1 ;

	 Crc = 0 ;
	 for(i=0;i<sizeData;i++)
	 {
	 
	   Crc ^= bufData[i];
	   for(j=0;j<8;j++)
	   {
	    if(Crc&0x0001)
		{ 

		Crc >>=1 ;
		Crc ^=0x08408 ;

		}
		else 
		Crc >>=1 ;

	   }
	 } 
	
	 return Crc ; 
 }
 
/*---------------------------------------------------------------------------
void HL_IntToBuffer(const uint16_t int_v, unsigned char *ret_buf);
功能: 将一个 16bit 的整数转换成 Buffer 数据, 高位在前
高位在前
*/
static void HL_IntToBuffer(const uint16_t int_v, unsigned char *ret_buf)
{
    ret_buf[0] = (unsigned char)(int_v >> 8);  // [0] 对应 --> 高位
    ret_buf[1] = (unsigned char)(int_v & 0xff);

 
}
/*---------------------------------------------------------------------------
 uint16_t HL_BufferToInt(const unsigned char *in_buf);
 功能: 将缓冲区数据转换成整数, 高位在前
 高位在前
*/
uint16_t HL_BufferToInit(const unsigned char *in_buf)
{
    uint16_t ret_n;

