jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
  return 0 ;

}


/*******************************************************************************
发送签到后，返回给终端的结构体数据
*******************************************************************************/				

/*签到*/	            //0X0100
unsigned char  SignInFun(void)
{
	 unsigned char i = 0 ;
	 long  Command = 0x0100 ;
	 long  Lenght = 0,j = 0  ;
	 long 	CmdLenght = 0 ;
	 unsigned char 	  Send_Buf[400];
	 mem_set_00(rx1Buf,sizeof(rx1Buf));	 //数据清零

	/*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;														
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));      /*终端的TID*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MID,sizeof(MID));  /*商户号TID 命令(1)+数据长度(2)+数据     100001*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MName,sizeof(MName));  /*商户名称*/
	GetBRWN();														 /*得到流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));   /*交易流水线*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));     /*批次号*/
    CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],APPVersion,sizeof(APPVersion)); /*终端所在地域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],ParaFileVersion,sizeof(ParaFileVersion)); /*终端所在地域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BDataFileVersion,sizeof(BDataFileVersion)); /*终端所在地域编号*/
    CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],ChechStatus,sizeof(ChechStatus)); /*终端所在地域编号*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
	 /*发送命令*/
     i = MealComparefunDemo(Command,Send_Buf,CmdLenght);
 	 if(i == 0x01)	 //
 	 return 1;  	  	 
	 Lenght = HL_BufferToInit(&rx1Buf[2]);	 //判断数据长度是否
	 if(Lenght == 0x00)
	 return  1 ;
//	 if(rx1Buf[7]!=0x00)/*是否应答命令*/
//	 return 1 ;
//     for(j=0;j<Lenght;j++)
//	 {
//	  CheckInitReturnUnion.CheckInitReturnBuffer[j]= rx1Buf[j];
//	  printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);	 
//	 }
//	 printf("\r\nACK: ");
//	 for(i=0;i<4;i++)
//	 {
//	 ACK[i] = rx1Buf[i+0x46];//得到
//	 printf("%x ",ACK[i]);
//	 }
//	 if(ACK[3]!=0x00)
//	 {
//	   return 1 ;
//	 }


//	 printf("\r\nMName: ");
	 for(i=0;i<23;i++)
	 {
	 MName[i] = rx1Buf[i+4];//得到商户
//	 printf("%x ",MName[i]);
	 }
//	 printf("\r\nBNO: ");
	 for(i=0;i<3;i++)
	 {
	 BNO[i+3] = rx1Buf[i+27+3];//得到批次号
//	 printf("%x ",BNO[i+3]);
	 }										 
//	 printf("\r\nAPPVersion: ");
	 for(i=0;i<11;i++)
	 {
	 APPVersion[i] = rx1Buf[i+0x21];//得到批次号
//	 printf("%x ",APPVersion[i]);
	 }
//	 printf("\r\nParaFileVersion: ");
	 for(i=0;i<11;i++)
	 {
	 ParaFileVersion[i] = rx1Buf[i+0x2c];//得到批次号
//	 printf("%x ",ParaFileVersion[i]);
	 }
	 printf("\r\nBDataFileVersion: ");
	 for(i=0;i<11;i++)
	 {
	 BDataFileVersion[i] = rx1Buf[i+0x37];//得到批次号
//	 printf("%x ",BDataFileVersion[i]); 
	 }
//	 printf("\r\nUpdataFlag: ");
	 for(i=0;i<4;i++)
	 {
	 UpdataFlag[i] = rx1Buf[i+0x42];//得到批次号
//	 printf("%x ",UpdataFlag[i]);
	 }

//	 printf("\r\nACK: ");
	 for(i=0;i<4;i++)
	 {
	 ACK[i] = rx1Buf[i+0x46];//得到
//	 printf("%x ",ACK[i]);
	 }
//
 //    printf("\r\nWordKeyCipher: ");
	 for(i=0;i<11;i++)
	 {
	 WordKeyCipher[i] = rx1Buf[i+0x4a];//得到批次号
//	 printf("%x ",WordKeyCipher[i]);
	 }

//	 printf("\r\nMAC: ");						
     for(i=0;i<11;i++)
	 {
	 MAC[i] = rx1Buf[i+0x55];//得到工作密文
//	 printf("%x ",MAC[i]);
	 }
     if(ACK[3]==0x24)
	 {
	   return 1 ;
	 }

   return 0 ;

}
void StructCopyToBuffer(unsigned char *dest)
{
    long j0=0,i=0,k=0;
   	 
    for(j0 = 0; j0 < 9; j0++) 
	{
	// dest[j0] = source[j0];
	  for(i=0;i<4;i++)
	  dest[k++]=Meal[j0].MealID[i];
	  for(i=0;i<20;i++)
	  dest[k++]=Meal[j0].MaelName[i];
	   
	  for(i=0;i<2;i++)
	  dest[k++]=Meal[j0].MealNum[i];
	    
	  for(i=0;i<4;i++)
	  dest[k++]=Meal[j0].MealPreace[i];
	   
	  for(i=0;i<4;i++)
	  dest[k++]=Meal[j0].MealType[i];
	 }
 
}
void BufferToStructCopy(unsigned char *dest,unsigned char Index)
{
      long i=0,k=0;
   	   
	  for(i=0;i<4;i++)
	  Meal[Index].MealID[i]=dest[k++];
	  for(i=0;i<20;i++)
	  Meal[Index].MaelName[i]=dest[k++];
	   
	  for(i=0;i<2;i++)
	  {
	  Meal[Index].MealNum[i]=dest[k++];
	//  printf("Meal[%d].MealNum[%d]=%x\r\n",Index,i,Meal[Index].MealNum[i]);
	   } 
	  for(i=0;i<4;i++)
	  Meal[Index].MealPreace[i]=dest[k++];
	   
	  for(i=0;i<4;i++)
	  Meal[Index].MealType[i]=dest[k++];
	 
 
}

/*产品对比*/	            //0X0200
unsigned char  MealDataCompareFun(void)
{

 	unsigned char i = 0 ;
  long  Lenght = 0 ,j;
//	unsigned char MealID = 0 ;
	long  CmdLenght = 0 ;
	unsigned char status = 0 ;
	unsigned char 	  Send_Buf[400];
	unsigned char     TempBuffer[35*9]={0};
	unsigned char     Buffer[306]={0};
	mem_set_00(rx1Buf,sizeof(rx1Buf));

	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	GetBRWN(); /*得到水流号*/
//	Batch ++ ;
//	Batch = 240 ;
//	BRWN[3] =    Batch /10000 ;
//	BRWN[3] =    BRWN[3] /10 *16 + BRWN[3]%10 ;
//	BRWN[4] =	 Batch /100 %100 ;
//	BRWN[4] =    BRWN[4] /10 *16 + BRWN[4]%10 ;
//	BRWN[5] =	 Batch %100;
//	BRWN[5] =    BRWN[5] /10 *16 + BRWN[5]%10 ;
    CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));                   /*交易流水线*/
    CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));                     /*批次号*/
    CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));       /*终端所在区域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO));   /*终端所在地域编号*/
 	Send_Buf[CmdLenght] =  0xbc ;	 //T
	Send_Buf[CmdLenght+1] =  0x01 ;	 //L
	Send_Buf[CmdLenght+2] =  0x32 ;	  //V
	CmdLenght += 3;
	StructCopyToBuffer(Buffer);
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Buffer,sizeof(Buffer));               /*终端所在地域编号*/ 
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;									
	
	/*发送命令*/
    i = MealComparefunDemo(0x0200,Send_Buf,CmdLenght);
 
    /*单片是否成功*/
	if(i==0x01)
	return 1;
	Lenght = HL_BufferToInit(&rx1Buf[2]);		//得到数据长度
	GetData(&ReturnData.Lenght[0],rx1Buf,Lenght,0xc0);	  /*返回状态*/
 	printf("Status=%x\r\n",ReturnData.Lenght[0]);
  if(ReturnData.Lenght[0] == 0x00 )
  return 0;	 /*数据正确*/
	if(ReturnData.Lenght[0] == 0x24 )
	{
	 Batch ++ ;
     return 1;	 /*数据正确*/
	}
	   CmdLenght = GetData(TempBuffer,rx1Buf,Lenght,0xBC);/*餐品对比*/
//	   	printf("StatusCmdLenght=%x\r\n",CmdLenght);
	   if(CmdLenght>34)
	   {				 
	      status  = CmdLenght / 35  ;
//		  	printf("Statusstatus=%x\r\n",status);
		  for(i=0;i<status;i++)
		  {
	       if(rx1Buf[45+i*35] ==0x03)
		   {
//		      printf("rx1Buf[%d]=%x\r\n",i,rx1Buf[45+i*35]);
//			  printf("rx1Buf[%d]=%x\r\n",i,rx1Buf[14+i*35]);
	          for(j=0;j<34;j++)
		     {
		      BufferToStructCopy(&TempBuffer[i*35],rx1Buf[14+35*i]-0x20);
		     }
		   }
		  }
		   return 1 ;/*餐品对比错误*/
	   }

    for(j=0;j<Lenght;j++)
    {
//	  CheckInitReturnUnion.CheckInitReturnBuffer[j]= rx1Buf[j];
//	  printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
    }

