jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
  return 0;

}

	          
/*******************************************************************************
* Function Name  : 2.3.3 签退		 0X0300
* Description    :退签函数
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char SignOutFun()
{

 	unsigned char i = 0 ;
    long  Lenght = 0 ,j;
	long 	CmdLenght = 0 ;
	unsigned char 	  Send_Buf[400];

   	mem_set_00(rx1Buf,sizeof(rx1Buf));
  /*水流号++*/
	 
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	Batch ++ ;
	Batch = 239 ;
	BRWN[3] =    Batch /1000000000000 ;
	BRWN[3] =    BRWN[3] /10 *16 + BRWN[3]%10 ;
	BRWN[4] =	 Batch /10000000000 %100 ;
	BRWN[4] =    BRWN[4] /10 *16 + BRWN[4]%10 ;
	BRWN[5] =	 Batch /100000000%100;
	BRWN[5] =    BRWN[5] /10 *16 + BRWN[5]%10 ;
	BRWN[6] =	 Batch /1000000%100;
	BRWN[6] =    BRWN[6] /10 *16 + BRWN[6]%10 ;
	BRWN[7] =	 Batch /10000 %100 ;
	BRWN[7] =    BRWN[7] /10 *16 + BRWN[7]%10 ;
	BRWN[8] =	 Batch/100 %100;
	BRWN[8] =    BRWN[8] /10 *16 + BRWN[8]%10 ;
	BRWN[9] =	 Batch %100;
	BRWN[9] =    BRWN[9] /10 *16 + BRWN[9]%10 ;

	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
    i = MealComparefunDemo(0x0300,Send_Buf,CmdLenght);

	if(i == 0x01)
	return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]);
	 for(j=0;j<Lenght+7;j++)
	 {
	 
//	  printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	  }
  
  return 0 ;

}


	       
 /*******************************************************************************
* Function Name  : 状态上传函数		 0X0300
* Description    :退签函数
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char StatusUploadingFun()
{

 	unsigned char i = 0 ;
	long  Lenght = 0 ,j;
	long 	CmdLenght = 0 ;
	unsigned char 	  Send_Buf[400];
	mem_set_00(rx1Buf,sizeof(rx1Buf));
    /*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	Batch ++ ;
	BRWN[3] =    Batch /1000000000000 ;
	BRWN[3] =    BRWN[3] /10 *16 + BRWN[3]%10 ;
	BRWN[4] =	 Batch /10000000000 %100 ;
	BRWN[4] =    BRWN[4] /10 *16 + BRWN[4]%10 ;
	BRWN[5] =	 Batch /100000000%100;
	BRWN[5] =    BRWN[5] /10 *16 + BRWN[5]%10 ;
	BRWN[6] =	 Batch /1000000%100;
	BRWN[6] =    BRWN[6] /10 *16 + BRWN[6]%10 ;
	BRWN[7] =	 Batch /10000 %100 ;
	BRWN[7] =    BRWN[7] /10 *16 + BRWN[7]%10 ;
	BRWN[8] =	 Batch/100 %100;
	BRWN[8] =    BRWN[8] /10 *16 + BRWN[8]%10 ;
	BRWN[9] =	 Batch %100;
	BRWN[9] =    BRWN[9] /10 *16 + BRWN[9]%10 ;


	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(DeviceStatus));  /*终端的状态*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
    i = MealComparefunDemo(0x0400,Send_Buf,CmdLenght);
	if(i == 0x01)
	return 1 ;
    Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	for(j=0;j<Lenght+7;j++)
	{
	 
//	 printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	
	}
  return 0 ;

}

 /*******************************************************************************
* Function Name  : 状态上传函数		 0X0300
* Description    :退签函数
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char EchoFun(void)
{

 	unsigned char i = 0 ;
	long  Lenght = 0 ,j;
	long 	CmdLenght = 0 ;
	unsigned char 	  Send_Buf[400];
	mem_set_00(rx1Buf,sizeof(rx1Buf));


    /*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DealData,sizeof(DealData));  /*终端的TID*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DealTime,sizeof(DealTime));  /*终端的TID*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
    i = MealComparefunDemo(0x0700,Send_Buf,CmdLenght);
	if(i == 0x01)  // 返回数据超时
	return 1 ;

	USART_ITConfig(UART5,USART_IT_RXNE,DISABLE);
    Lenght = HL_BufferToInit(&rx1Buf[2]) ;

	if(Lenght == 0x00)
	{
	 USART_ITConfig(UART5,USART_IT_RXNE,ENABLE);
	 return 1 ;
	}
	for(j=0;j<Lenght+7;j++)
	{	 
//	 printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	}
	 if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)	 //表示正确
	 {


		 //  tmp_yy  = rx1Buf[7]/16*10+rx1Buf[7]%16 ;/*年*/
		   tmp_yy  = rx1Buf[8]/16*10+rx1Buf[8]%16 ;/*年*/ 
//		   printf("tmp_yy=%d\r\n",tmp_yy); 
		   tmp_m2  = rx1Buf[9]/16*10+rx1Buf[9]%16 ;/*月*/
//		   printf("tmp_yy=%d\r\n",tmp_m2); 
		   tmp_dd  = rx1Buf[10]/16*10+rx1Buf[10]%16 ;/*日*/
//		   printf("tmp_dd=%d\r\n",tmp_dd); 

		   tmp_hh  = rx1Buf[14]/16*10+rx1Buf[14]%16 ;/*时*/
		   tmp_mm  = rx1Buf[15]/16*10+rx1Buf[15]%16 ;/*分*/  
		   tmp_ss  = rx1Buf[16]/16*10+rx1Buf[16]%16 ;/*秒*/		

		   rx1Buf[7]  = rx1Buf[7]/16*10+rx1Buf[7]%16 ;/*年*/
		   rx1Buf[8]  = rx1Buf[8]/16*10+rx1Buf[8]%16 ;/*年*/  
		   rx1Buf[9]  = rx1Buf[9]/16*10+rx1Buf[9]%16 ;/*月*/
		   rx1Buf[10]  = rx1Buf[10]/16*10+rx1Buf[10]%16 ;/*日*/

		   rx1Buf[14]  = rx1Buf[14]/16*10+rx1Buf[14]%16 ;/*时*/
		   rx1Buf[15]  = rx1Buf[15]/16*10+rx1Buf[15]%16 ;/*分*/  
		   rx1Buf[16]  = rx1Buf[16]/16*10+rx1Buf[16]%16 ;/*秒*/		  
//		   for(i=0;i<4;i++)
//		   printf("rx1Buf[%d]=%d\r\n",i,rx1Buf[i+7]);

//		   for(i=0;i<3;i++)
//		   printf("rx1Buf[%d]=%d\r\n",i,rx1Buf[i+14]);

		 USART_ITConfig(UART5,USART_IT_RXNE,ENABLE);	
	  return 0 ;  
	 }

	 	 USART_ITConfig(UART5,USART_IT_RXNE,ENABLE);
    return 1 ;

}


 /*******************************************************************************
* Function Name  : 状态上传函数		 0X0300
* Description    :退签函数
* Input          : void
* Output         : void
* Return         : void
                                       08 10 00 0f c0 00 01 24 c9 00 08 00 00 00 00 00 00 00 00 03 e8 47 
                                     //应答码 2位          MAC 8位
*******************************************************************************/

CustomerSel__struction CustomerSel;
unsigned char TakeMealsFun(unsigned char *SendBuffer)
//unsigned char TakeMealsFun(unsigned char *Cardbuff,long 	CardLenght)
{

