jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
unsigned char MealGroupUploadingFun(void)
{
   	unsigned char i = 0 ;
	long  Lenght = 0 ,j=0;
	long  CmdLenght = 0 ;
	 unsigned char 	 Send_Buf[500];
	unsigned char    Buffer[327]={0x00,0x00,0x0a}; 
	/*接受缓冲区清0*/
	mem_set_00(rx1Buf,sizeof(rx1Buf));
	/*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	Batch ++ ;
	Batch = 239 ;
	BRWN[3] =    Batch /1000000000000 ;
	BRWN[3] =    BRWN[3] /10 *16 + BRWN[3]%10 ;
	BRWN[4] =	 Batch /10000000000 %100 ;
	BRWN[4] =    BRWN[4] /10 *16 + BRWN[4]%10 ;
	BRWN[5] =	 Batch /100000000%100;
	BRWN[5] =    BRWN[5] /10 *16 + BRWN[5]%10 ;
	BRWN[6] =	 Batch /1000000%100;
	BRWN[6] =    BRWN[6] /10 *16 + BRWN[6]%10 ;
	BRWN[7] =	 Batch /10000 %100 ;
	BRWN[7] =    BRWN[7] /10 *16 + BRWN[7]%10 ;
	BRWN[8] =	 Batch/100 %100;
	BRWN[8] =    BRWN[8] /10 *16 + BRWN[8]%10 ;
	BRWN[9] =	 Batch %100;
	BRWN[9] =    BRWN[9] /10 *16 + BRWN[9]%10 ;

	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
 	Send_Buf[CmdLenght]   =  0xbb ;	   //T
	Send_Buf[CmdLenght+1] =  0x01 ;	   //L
	Send_Buf[CmdLenght+2] =  0x44 ;	   //V
	CmdLenght += 3;

	 StructCopyToBuffer00(&Buffer[3],0);
	 StructCopyToBuffer00(&Buffer[3+0x24],1);
	 StructCopyToBuffer00(&Buffer[3+0x24*2],2);
	 StructCopyToBuffer00(&Buffer[3+0x24*3],3);
	 StructCopyToBuffer00(&Buffer[3+0x24*4],4);
	 StructCopyToBuffer00(&Buffer[3+0x24*5],5);
	 StructCopyToBuffer00(&Buffer[3+0x24*6],6);
	 StructCopyToBuffer00(&Buffer[3+0x24*7],7);
	 StructCopyToBuffer00(&Buffer[3+0x24*8],8);

   printf("%x\r\n",sizeof(MealGroup_struction));
 	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/

	 

	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Buffer,sizeof(Buffer));  /*批次号*/
	 Send_Buf[CmdLenght] = 0x03 	;
	 CmdLenght+=0x03;
	/*
	 这里添加没有上传的产品名字
	*/
	 i = MealComparefunDemo(0x0500,Send_Buf,CmdLenght);
	 if(i == 0x01)
	 return 1 ;
     Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 for(j=0;j<Lenght+7;j++)
	 {
//	  printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	 }

	 return 0 ;

}
  /*******************************************************************************
* Function Name  : ClearingFun		 披上送
* Description    : 退签功能
* Input          : void
* Output         : void
* Return         : void	  
*******************************************************************************/
unsigned char    ClearingFun(void)
{
  unsigned char i = 0 ;
	long  Lenght = 0 ,j=0;
	unsigned char 	  Send_Buf[400];
	long  CmdLenght = 0 ;	 
	/*接受缓冲区清0*/
	mem_set_00(rx1Buf,sizeof(rx1Buf));
	/*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
//	BRWN[3] =    Batch /1000000000000 ;
//	BRWN[3] =    BRWN[3] /10 *16 + BRWN[3]%10 ;
//	BRWN[4] =	 Batch /10000000000 %100 ;
//	BRWN[4] =    BRWN[4] /10 *16 + BRWN[4]%10 ;
//	BRWN[5] =	 Batch /100000000%100;
//	BRWN[5] =    BRWN[5] /10 *16 + BRWN[5]%10 ;
//	BRWN[6] =	 Batch /1000000%100;
//	BRWN[6] =    BRWN[6] /10 *16 + BRWN[6]%10 ;
//	BRWN[7] =	 Batch /10000 %100 ;
//	BRWN[7] =    BRWN[7] /10 *16 + BRWN[7]%10 ;
//	BRWN[8] =	 Batch/100 %100;
//	BRWN[8] =    BRWN[8] /10 *16 + BRWN[8]%10 ;
//	BRWN[9] =	 Batch %100;
//	BRWN[9] =    BRWN[9] /10 *16 + BRWN[9]%10 ;

    GetBRWN();

	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC)); /*MAC*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
	 i = MealComparefunDemo(0x0500,Send_Buf,CmdLenght);
	 if(i == 0x01)
	 return 1 ;
     Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 for(j=0;j<Lenght+7;j++)
	 {
//	  printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	 }

	 return 0 ;
}

 /*******************************************************************************
* Function Name  : SignInFunction		 
* Description    : 签到函数
* Input          : void
* Output         : void
* Return         : void	  
*******************************************************************************/
 void  SignInFunction(void)
 {
 unsigned char i = 10 ;
    do 
	{
	  if(SignInFun()==0x00)
	  break;
	  delay_ms(500);   
	}while(--i);

	if(i == 0x00)
	return ;
	
	 
 }
 
  /*******************************************************************************
* Function Name  : SignInFunction		 
* Description    : 签到函数
* Input          : void
* Output         : void
* Return         : void	  
*******************************************************************************/
 void  EchoFuntion(void (*fptr)(void))
 {
 unsigned char i = 10 ;
    do 
	{
	  if(EchoFun()==0x00)
	  break;
	  delay_ms(500);   
	}while(--i);

	if(i == 0x00)
	return ;
	(*fptr)() ;
	 
 }
   /*******************************************************************************
* Function Name  : MealGroupUploadingFun		 披上送
* Description    : 餐品披上送
* Input          : void
* Output         : void
* Return         : void	  
*******************************************************************************/
unsigned char MealDataCompareFunction(void)
 {
   unsigned char i = 100;
   while(i)
   {
    if(MealDataCompareFun()==0x00)
	  return 0 ;
	  --i ;
	  delay_ms(100);
   }
    return 1 ;
 }

 
unsigned char 	Resend(unsigned char *p,long lenght)
 {
	 unsigned char Waittimeout = 100 ;
	 long Lenght,j;
	 mem_set_00(rx1Buf,sizeof(rx1Buf));
	 CmdDataSend(p,lenght);	//发送数据
   /*等待数据返回*/
   while(--Waittimeout)
	 {
		   delay_ms(10);
		   if(F_RX1_Right)
		   {
		    F_RX1_Right = 0 ;
		    break;
		   }		   
   }
  if(Waittimeout == 0 )
  return 1 ;
	
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	if(Lenght == 0x00)/*判断数据长度*/
	return 1 ;
	for(j=0;j<Lenght+7;j++)
	{
	 
//	 printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);

	 }
	 if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)	 //表示正确
	 {
	  	
		if(rx1Buf[7]==0x00)/*是否应答命令*/
		{
		   return 0 ;
		}
		else
		return 1 ;
//		if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
//		{	 
//           return 1 ;
//		}
	   
	 }
  return 0 ;

 
  return 0 ;
}
 